2017/12/27/org-mode-export-test.html
<!DOCTYPE html>
<html lang="en">

  <head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <title>Org-Mode for Jekyll</title>
  <meta name="description" content="Org-Mode Structure I love using org-mode to structure ideas into documentation. I&#39;ve just started this blog using Jekyll, but I&#39;d love for the posts to be wr...">

  <link rel="stylesheet" href="/assets/main.css">
  <link rel="canonical" href="https://www.ennuiocclusion.github.io/2017/12/27/org-mode-export-test.html">
  <link rel="alternate" type="application/rss+xml" title="Ennui Occlusion" href="/feed.xml">
  
  
</head>


  <body>

    <header class="site-header" role="banner">

  <div class="wrapper">
    
    
    <a class="site-title" href="/">Ennui Occlusion</a>
  
    
      <nav class="site-nav">
        <input type="checkbox" id="nav-trigger" class="nav-trigger" />
        <label for="nav-trigger">
          <span class="menu-icon">
            <svg viewBox="0 0 18 15" width="18px" height="15px">
              <path fill="#424242" d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z"/>
              <path fill="#424242" d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z"/>
              <path fill="#424242" d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z"/>
            </svg>
          </span>
        </label>

        <div class="trigger">
          
            
            
          
            
            
            <a class="page-link" href="/about/">About</a>
            
          
            
            
          
            
            
          
            
            
          
        </div>
      </nav>
    
  </div>
</header>


    <main class="page-content" aria-label="Content">
      <div class="wrapper">
        <article id="post-page" >
    <a href=""><h2>Org-Mode for Jekyll</h2></a>
    <time>27 Dec 2017</time>
    <div class="content" >
            <h1>Org-Mode Structure</h1>
<p>I love using org-mode to structure ideas into documentation. I've just started this blog using Jekyll, but I'd love for the posts to be written in org-mode rather the straight markup. I've got some plans for the future about how I might want to swap out the static-site generator and also do a bit of literate programming. Org-mode really shines in these tasks, so let's get set up for success now.</p>
<p>This post is a test to understand how exactly I could go about doing that. Let's see how it goes.</p>
<h1>Testing</h1>
<p>In order to test the site I need to build it. The code to do so looks a little like follows from the project root-directory.</p>
<pre class="src" lang="bash">
bundle exec jekyll build
</pre>
<h1>First Try - Do Nothing</h1>
<p>My first attempt at this is just to see if it might secretly be a default feature of Jekyll, a bit like how you can just stick org files of Github and have it automatically convert to Markdown. This does not work. Putting this file in the <code>_posts</code> folder does make it show up, but clicking the link begins downloading the actual org file. No Bueno.</p>
<h1>Second Try - Using org-mode export to Markdown</h1>
<p>Using the org-export function to markdown, which in spacemacs is mapped to ~, e e~ you can export directly to markdown. This get's read by Jekyll as markdown, but gives browser default html, with none of our links or static site goodness. We must go deeper.</p>
<h1>Third Try - Once More With Feeling</h1>
<p>Turns out the markdown export can work, we just need to coax the file into something Jekyll wants to play with. There's a few tasks we need to accomplish, getting rid of the table of contents on export, introducing the front matter for the post, and changing the exported file extension.</p>
<h2>Removing the Table of Contents</h2>
<p>This one's pretty simple and just consists of adding this line to the head of your org file.</p>
<pre class="src" lang="org">
#+OPTIONS: toc:nil
</pre>
<h2>Introducing Front Matter</h2>
<p>This is all the metadata that Jekyll uses to title and format your blog post. It needs to be repeated verbatim at the front of the markdown document. We can use Org's src block functionality to do this with something this:</p>
<pre class="src" lang="org">
#+BEGIN_SRC markdown
---
layout: post
title: Org-Mode for Jekyll
date:   2017-12-27 18:38:15 -0800
categories: meta
---
#+END_SRC
</pre>
<p>One of the very nice things about org-mode is how easy it is to pop in and configure these blocks for literate programming, all you need to do is hit <code>&lt; s TAB</code> then enter the name of the language for that source block. In spacemacs you can then hit ~, '~ to pop open a new buffer that's in the major mode for the language of that source block. Hit ~, c~ to save your changes back into your original buffer.</p>
<p>You're good to export with ~, e e m o~. &lt;sup&gt;You don't actually have to remember these commands they pop up in the mini-buffer as you start typing.&lt;/sup&gt;</p>
<p>There is just one last problem with the front matter that needs to be fixed. There's about four spaces in front of each line from the exporter, you need to delete these for them to be properly parsed by Jekyll.</p>
<h2>File Extension</h2>
<p>This one got me tripped up for a little longer than I'd like to admit.  Jekyll apparently looks for files with a full <code>.markdown</code> extension. If you have just the <code>.md</code> extensions that comes out of the org-export you will get a post takes web brutalism to heart. So rename and you're good to go. Now Jekyll will process this file as if you'd written it in regular Markdown and you're ready to keep on cooking.</p>
<h1>Next Steps</h1>
<p>Now that the basic idea has proven feasible and I know the basic tasks that need to be accomplished, let's build some tools to automate all this in a future post.</p>

    </div>    
</article>
    <div id="disqus_thread"></div>
<script>

/**
*  RECOMMENDED CONFIGURATION VARIABLES: EDIT AND UNCOMMENT THE SECTION BELOW TO INSERT DYNAMIC VALUES FROM YOUR PLATFORM OR CMS.
*  LEARN WHY DEFINING THESE VARIABLES IS IMPORTANT: https://disqus.com/admin/universalcode/#configuration-variables*/
/*
var disqus_config = function () {
this.page.url = PAGE_URL;  // Replace PAGE_URL with your page's canonical URL variable
this.page.identifier = PAGE_IDENTIFIER; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
};
*/
(function() { // DON'T EDIT BELOW THIS LINE
var d = document, s = d.createElement('script');
s.src = 'https://ennuiocclusion.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>


      </div>
    </main>

    <footer class="site-footer">

  <div class="wrapper">

    <h2 class="footer-heading">Ennui Occlusion</h2>

    <div class="footer-col-wrapper">
      <div class="footer-col footer-col-1">
        <ul class="contact-list">
          <li>
            
              Ennui Occlusion
            
            </li>
            
            <li><a href="mailto:morris.com@gmail.com">morris.com@gmail.com</a></li>
            
        </ul>
      </div>

      <div class="footer-col footer-col-2">
        <ul class="social-media-list">
          
          <li>
            <a href="https://github.com/ennuiocclusion"><span class="icon icon--github"><svg viewBox="0 0 16 16" width="16px" height="16px"><path fill="#828282" d="M7.999,0.431c-4.285,0-7.76,3.474-7.76,7.761 c0,3.428,2.223,6.337,5.307,7.363c0.388,0.071,0.53-0.168,0.53-0.374c0-0.184-0.007-0.672-0.01-1.32 c-2.159,0.469-2.614-1.04-2.614-1.04c-0.353-0.896-0.862-1.135-0.862-1.135c-0.705-0.481,0.053-0.472,0.053-0.472 c0.779,0.055,1.189,0.8,1.189,0.8c0.692,1.186,1.816,0.843,2.258,0.645c0.071-0.502,0.271-0.843,0.493-1.037 C4.86,11.425,3.049,10.76,3.049,7.786c0-0.847,0.302-1.54,0.799-2.082C3.768,5.507,3.501,4.718,3.924,3.65 c0,0,0.652-0.209,2.134,0.796C6.677,4.273,7.34,4.187,8,4.184c0.659,0.003,1.323,0.089,1.943,0.261 c1.482-1.004,2.132-0.796,2.132-0.796c0.423,1.068,0.157,1.857,0.077,2.054c0.497,0.542,0.798,1.235,0.798,2.082 c0,2.981-1.814,3.637-3.543,3.829c0.279,0.24,0.527,0.713,0.527,1.437c0,1.037-0.01,1.874-0.01,2.129 c0,0.208,0.14,0.449,0.534,0.373c3.081-1.028,5.302-3.935,5.302-7.362C15.76,3.906,12.285,0.431,7.999,0.431z"/></svg>
</span><span class="username">ennuiocclusion</span></a>

          </li>
          

          
          <li>
            <a href="https://twitter.com/ennuiocclusion"><span class="icon icon--twitter"><svg viewBox="0 0 16 16" width="16px" height="16px"><path fill="#828282" d="M15.969,3.058c-0.586,0.26-1.217,0.436-1.878,0.515c0.675-0.405,1.194-1.045,1.438-1.809c-0.632,0.375-1.332,0.647-2.076,0.793c-0.596-0.636-1.446-1.033-2.387-1.033c-1.806,0-3.27,1.464-3.27,3.27 c0,0.256,0.029,0.506,0.085,0.745C5.163,5.404,2.753,4.102,1.14,2.124C0.859,2.607,0.698,3.168,0.698,3.767 c0,1.134,0.577,2.135,1.455,2.722C1.616,6.472,1.112,6.325,0.671,6.08c0,0.014,0,0.027,0,0.041c0,1.584,1.127,2.906,2.623,3.206 C3.02,9.402,2.731,9.442,2.433,9.442c-0.211,0-0.416-0.021-0.615-0.059c0.416,1.299,1.624,2.245,3.055,2.271 c-1.119,0.877-2.529,1.4-4.061,1.4c-0.264,0-0.524-0.015-0.78-0.046c1.447,0.928,3.166,1.469,5.013,1.469 c6.015,0,9.304-4.983,9.304-9.304c0-0.142-0.003-0.283-0.009-0.423C14.976,4.29,15.531,3.714,15.969,3.058z"/></svg>
</span><span class="username">ennuiocclusion</span></a>

          </li>
          
        </ul>
      </div>

      <div class="footer-col footer-col-3">
        <p>Exploring the things that interest me. All input and consideration is greatly appreciated.</p>
      </div>
    </div>

  </div>

</footer>


  </body>

</html>
